Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON LATAM_Bitten Contract.tmx
Source language: en
Languages: es_419

source: I heard some shouting. what's wrong?
es_419: escuché gritos. ¿qué sucede?

source: not only is the pain gone, but don't you feel quite refreshed?
es_419: además de que se fue el dolor, ¿no te sientes también renovada?

source: what right does he have to get angry?
es_419: ¿con qué derecho se cree para enfadarse?

source: It doesn't matter.
es_419: no importa.

source: I'm perfectly healthy now. you don't have to worry!
es_419: estoy muy bien. ¡no hay nada de qué preocuparse!

source: see you at the after party.
es_419: nos vemos en la fiesta.

source: chae-i's acting is superb, as always.
es_419: chae-i está magnífica, como siempre.

source: huh? by a vampire? yeah...
es_419: ¿eh? ¿por un vampiro? sí…

source: I didn't know what you'd like. so I brought some flowers and cake.
es_419: no sabía qué te gustaría, así que traje flores y un pastel.

source: did it...
es_419: ¿no te fue…

source: what a load of crap.
es_419: pura basura.

source: be honest. you like chae-i, don't you?
es_419: sé sincero. te gusta chae-i, ¿verdad?

source: call me if things ever get too difficult.
es_419: llámame si las cosas se complican.

source: just focus on the important stuff!
es_419: ¡enfócate en las cosas importantes!

source: l-long time no--
es_419: c-cuánto tiempo…

source: I'm sorry, my friend!!!
es_419: ¡¡¡lo siento, amigo!!!

source: yeah. sera and I left our agency at the same time.
es_419: sip. sera y yo salimos de la agencia al mismo tiempo.

source: hehe...
es_419: je, je…

source: you took a shower?! why?!
es_419: ¡¿te bañaste?! ¡¿por qué?!

source: nah! yun's too good for her!
es_419: nop, ¡yun es demasiado para ella!

source: I'm really close to ijun, so I didn't think to dress properly...
es_419: soy muy cercano a ijun, así que no pensé en vestirme mejor…

source: okay... thanks...
es_419: bueno… gracias…

source: but what's chae-i doing here?
es_419: oye, ¿qué hace chae-i aquí?

source: ...come to me.
es_419: … ven a mí.

source: I had the role of minyeong choi.
es_419: tuve el papel de minyeong choi.

source: huh???
es_419: ¿¿¿eh???

source: ...another person told me I sparkle when I act.
es_419: … otra persona me dijo que brillo cuando actúo.

source: I can't let her down.
es_419: no puedo decepcionarla.

source: y...eah...
es_419: siiip…

source: you promise?
es_419: ¿lo prometes?

source: did... you hear anything from sera?
es_419: ¿sabes… algo de sera?

source: disguisted
es_419: DISGUSTADA

source: tsk tsk
es_419: tch tch

source: let's just drink this.
es_419: bebámonos esta.

source: please? ijun!
es_419: ¡por favor, ijun!

source: no, we don't really need to.
es_419: no, realmente no es necesario.

source: what was he like?
es_419: ¿cómo era?

source: I don't mind the age difference as long as we like each other.
es_419: no me importa la diferencia de años siempre que nos gustemos.

source: have you been bitten before, oppa?
es_419: ¿te han mordido antes, oppa?

source: it...
es_419: estuvo…

source: actually, I want to...
es_419: la verdad, quisiera…

source: I heard the controversy happened because of your headaches.
es_419: supe de la controversia que se ha formado por sus dolores de cabeza.

source: puahaha
es_419: JUAJAJA

source: how was the meeting?
es_419: ¿cómo estuvo la reunión?

source: I'll make you regret this!
es_419: ¡haré que te arrepientas!

source: I hope she's better...
es_419: espero que esté mejor…

source: it wouldn't be good for us to get noticed together... so I'll text you the passcode for the building entrance.
es_419: no sería bueno para nosotros que nos vieran juntos… así que te escribo en un mensaje el código de la entrada.

source: I'm sorry!
es_419: ¡lo siento!

source: uh, I...
es_419: eh, yo…

source: the mood brightened when he showed up...
es_419: el ambiente se anima cuando él aparece…

source: whoa
es_419: GUAU

source: flutter
es_419: TIEMBLA

source: jiseong's not a vampire, right?
es_419: jiseong no es un vampiro, ¿verdad?

source: Will Chae-i find relief?
es_419: ¿Chae-i encontrará mejoría?

source: can't smile because of the mask
es_419: no puede reírse por la mascarilla

source: he's still the same.
es_419: sigue siendo el mismo.

source: hmm, how about waiting a little to see how things go first?
es_419: mmm, ¿y si esperamos un poco para ver cómo van las cosas?

source: incoming
es_419: llamando

source: excuse me?
es_419: ¿perdona?

source: did you get the results?
es_419: ¿tienes los resultados?

source: that's true... but how long has it been since your last drink?
es_419: es cierto… pero ¿cuánto tiempo ha pasado desde la última vez?

source: no matter how often we bite you, it's a temporary fix. it doesn't make you get better.
es_419: sin importar cada cuanto te mordamos, es un arreglo temporal. no vas a mejorar.

source: no wonder I feel so light and energized!
es_419: sin duda, ¡me siento liviana y con más energía!

source: is that not it?
es_419: es eso, ¿verdad?

source: wow!!
es_419: ¡¡guau!!

source: I'm taller, so call me nuna*!
es_419: ¡soy más alta, así que dime nuna*!

source: right ijun?
es_419: ¿verdad, ijun?

source: I'll keep looking though!
es_419: ¡igual seguiré buscando!

source: oh, but I heard he's filming the same drama as me...
es_419: ah, y supe que estará en la misma novela que yo…

source: you don't like yun, do you?
es_419: no te cae bien yun, ¿verdad?

source: hey, look at leon! haha. his eyes are glued, hahaha!
es_419: ¡ey, miren a león! ja, ja. ¡se le pegaron los ojos! ja, ja.

source: According to TSBC, the 11th episode of the drama Time to Date, which aired on the 17th, was viewed in real-time by 7.5 million and viewed 52 million times total in Korea alone.
es_419: según tsbc, el episodio 11 de la novela hora de salir, que se estrenó el día 17, fue vista en tiempo real por 7.5 millones de personas. y se reprodujo 52 millones de veces solo en corea.

source: Incoming...
es_419: llamando…

source: great! have another drink, then!
es_419: ¡entonces bébete otro!

source: leon... is that you?
es_419: león, ¿eres tú?

source: oh, no, no!
es_419: ¡ay, no, no!

source: bleh... gross!
es_419: puaj… ¡guácala!

source: no. I really liked this oppa as a kid...
es_419: no. la verdad me gustó ese oppa cuando era niña…

source: I want to disappear...
es_419: quiero desaparecer…

source: mm-hm.
es_419: ajá.

source: what more could he possibly need?
es_419: ¿qué más podría necesitar?

source: ...I definitely feel different.
es_419: … de verdad me siento diferente.
